general/english/en_vocab_spoken.org
#+setupfile: ../../styles/readtheorg.setup
#+title: English Vocabulary: Spoken

* 名词

| choice   | selection  |
|----------+------------|
| person   | individual |
|----------+------------|
| pleasure | enjoyment  |
|----------+------------|
| thing    | stuff      |

| 依恋，爱慕 | attachment | + with |
|------------+------------+--------|
| 融合，结合 | blend      | + of   |
|------------+------------+--------|
| 保证       | guarantee  |        |
|------------+------------+--------|
| 财富       | treasure   |        |

* 名词短语

| the first one | the former |

| 共同语言 | common language   |
|----------+-------------------|
| 生活节奏 | life pace         |
|----------+-------------------|
| 心理健康 | mental well-being |
|----------+-------------------|
| 相互尊重 | mutual respect    |
|----------+-------------------|
| 社交活动 | social activities |

* 动词

| bother      | get on one's nerve        |
|-------------+---------------------------|
| continue    | keep on                   |
|-------------+---------------------------|
| face        | confront                  |
|-------------+---------------------------|
| feel        | get a sense of            |
|-------------+---------------------------|
| help        | assist                    |
|             | do ... a favor            |
|-------------+---------------------------|
| include     | comprise                  |
|-------------+---------------------------|
| influence   | impose great influence on |
|-------------+---------------------------|
| like        | admire                    |
|-------------+---------------------------|
| love        | adore                     |
|-------------+---------------------------|
| participate | take part in              |
|-------------+---------------------------|
| play        | hang out                  |
|-------------+---------------------------|
| see         | spot                      |
|-------------+---------------------------|
| seem        | sound                     |
|-------------+---------------------------|
| support     | be all for                |
|-------------+---------------------------|
| surprise    | freak out                 |
|-------------+---------------------------|
| understand  | figure out                |
|-------------+---------------------------|
| want        | expect                    |

| 比……重要 | outweigh |
|------------+----------|
| 使转向     | redirect | 
* 动词短语

| be good for   | be beneficial to |
|---------------+------------------|
| become better | improve          |
|---------------+------------------|
| become worse  | deteriorate      |
|---------------+------------------|
| deal with     | cope with        |
|---------------+------------------|
| try hard to   | strive to        |
|---------------+------------------|
| want to       | dream to         |
|               | intend to        |

| 建立     | build up    |
|----------+-------------|
| 在外面吃 | eat out     |
|----------+-------------|
| 放松     | get relaxed |
|----------+-------------|
| 位于     | situated in |
|----------+-------------|
| 求助于   | turn to     |

* 动宾短语

| 十分受欢迎     | enjoys great popularity |
|----------------+-------------------------|
| 带来很多欢乐   | brings a lot of fun to  |
|----------------+-------------------------|
| 使……远离…… | keep ... far from ...   |
|----------------+-------------------------|
| 转移注意力     | take one's mind off ... |

* 形容词

| attractive | appealing                          |
|------------+------------------------------------|
| bad        | severe                             |
|------------+------------------------------------|
| beautiful  | stunning                           |
|            | gorgeous                           |
|            | aesthetically pleasing to our eyes |
|------------+------------------------------------|
| big        | gigantic                           |
|            | enormous                           |
|------------+------------------------------------|
| changing   | varying                            |
|------------+------------------------------------|
| cheap      | economical                         |
|------------+------------------------------------|
| common     | commonplace                        |
|------------+------------------------------------|
| cute       | adorable                           |
|------------+------------------------------------|
| different  | distinct                           |
|------------+------------------------------------|
| difficult  | tough                              |
|------------+------------------------------------|
| disgusting | gross                              |
|------------+------------------------------------|
| essential  | indispensable                      |
|------------+------------------------------------|
| expensive  | pricey                             |
|------------+------------------------------------|
| famous     | celebrated                         |
|------------+------------------------------------|
| few        | scarce                             |
|            | limited number of                  |
|------------+------------------------------------|
| good       | decent                             |
|            | desirable                          |
|------------+------------------------------------|
| happy      | delighted                          |
|------------+------------------------------------|
| hard       | tough                              |
|------------+------------------------------------|
| important  | vital                              |
|            | essential                          |
|------------+------------------------------------|
| many       | numerous                           |
|            | a multitude of                     |
|            | vast amounts of                    |
|            | tons, piles, loads of              |
|------------+------------------------------------|
| more       | a wider range of                   |
|------------+------------------------------------|
| new        | fresh                              |
|------------+------------------------------------|
| old        | conventional                       |
|------------+------------------------------------|
| perfect    | flawless                           |
|            | spotless                           |
|------------+------------------------------------|
| poor       | impoverished                       |
|------------+------------------------------------|
| proper     | ideal                              |
|------------+------------------------------------|
| real       | genuine                            |
|            | authentic                          |
|------------+------------------------------------|
| reasonable | make sense                         |
|------------+------------------------------------|
| same       | equally                            |
|------------+------------------------------------|
| small      | limited                            |
|------------+------------------------------------|
| strange    | odd                                |
|            | weird                              |
|------------+------------------------------------|
| whole      | entire                             |

| 有限的           | limited    |
|------------------+------------|
| 合格的，有资格的 | qualified  |
|------------------+------------|
| 合理的，正确的   | reasonable |
|                  | sensible   |
|------------------+------------|
| 典型的，代表性的 | typical    |
|------------------+------------|
| 不寻常的         | uncommon   |
|                  | unusual    |

* 形容词短语

| kinds of | a range of |

* 副词

| almost     | practically      |
|------------+------------------|
| always     | constantly       |
|            | around the clock |
|------------+------------------|
| before     | ahead            |
|------------+------------------|
| certainly  | surely           |
|------------+------------------|
| completely | entirely         |
|------------+------------------|
| fast       | rapidly          |
|------------+------------------|
| like       | similar to       |
|------------+------------------|
| soon       | shortly          |
|------------+------------------|
| very       | pretty           |
|            | terribly         |
|            | extremely        |
|------------+------------------|
| when       | as soon as       |

| 几乎，差不多   | nearly    |
|----------------+-----------|
| 明显地，显然地 | obviously |
|----------------+-----------|
| 相对地，比较地 | fairly    |
* 副词短语

| a lot           | massively   |
|-----------------+-------------|
| during the day  | at day time |
|-----------------+-------------|
| in the same way | alike       |
|-----------------+-------------|
| not often       | rarely      |

| 次数最多   | for the most times        |
|------------+---------------------------|
| 从心底     | in the bottom of my heart |
|------------+---------------------------|
| 在很多场合 | in various occasions      |
|------------+---------------------------|
| 不逊色于   | no less than              |
|------------+---------------------------|
| 工作以外   | off the work              |
|------------+---------------------------|
| 某种程度上 | to some extent            |

时间
| 直到现在     | up until now       |
| 直到那时     | up until then      |
|--------------+--------------------|
| 每周         | on a weekly basis  |
| 定期，经常   | on a regular basis |
|--------------+--------------------|
| 时不时，偶尔 | every now and then |
|              | once in a while    |
* 其他短语

| is different for ... and ... | vary between ... and ... |
|------------------------------+--------------------------|
| is different with ...        | differ from ...          |

| 没什么坏处 | won't hurt               |
|            | can never hurt           |
|------------+--------------------------|
| 没什么意义 | It's pointless to ...    |
|            | There is no sense in ... |

| 来自……的压力 | pressure coming from ... |
