general/english/en_vocab_spoken.html
---
title: "English Vocabulary: Spoken"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>English Vocabulary: Spoken</title>
<!-- 2016-05-27 周五 19:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">English Vocabulary: Spoken</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 名词</a></li>
<li><a href="#sec-2">2. 名词短语</a></li>
<li><a href="#sec-3">3. 动词</a></li>
<li><a href="#sec-4">4. 动词短语</a></li>
<li><a href="#sec-5">5. 动宾短语</a></li>
<li><a href="#sec-6">6. 形容词</a></li>
<li><a href="#sec-7">7. 形容词短语</a></li>
<li><a href="#sec-8">8. 副词</a></li>
<li><a href="#sec-9">9. 副词短语</a></li>
<li><a href="#sec-10">10. 其他短语</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 名词</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">choice</th>
<th scope="col" class="left">selection</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">person</td>
<td class="left">individual</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">pleasure</td>
<td class="left">enjoyment</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">thing</td>
<td class="left">stuff</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">依恋，爱慕</th>
<th scope="col" class="left">attachment</th>
<th scope="col" class="left">+ with</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">融合，结合</td>
<td class="left">blend</td>
<td class="left">+ of</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">保证</td>
<td class="left">guarantee</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">财富</td>
<td class="left">treasure</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 名词短语</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">the first one</td>
<td class="left">the former</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">共同语言</th>
<th scope="col" class="left">common language</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">生活节奏</td>
<td class="left">life pace</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">心理健康</td>
<td class="left">mental well-being</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">相互尊重</td>
<td class="left">mutual respect</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">社交活动</td>
<td class="left">social activities</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 动词</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">bother</th>
<th scope="col" class="left">get on one's nerve</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">continue</td>
<td class="left">keep on</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">face</td>
<td class="left">confront</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">feel</td>
<td class="left">get a sense of</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">help</td>
<td class="left">assist</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">do &#x2026; a favor</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">include</td>
<td class="left">comprise</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">influence</td>
<td class="left">impose great influence on</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">like</td>
<td class="left">admire</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">love</td>
<td class="left">adore</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">participate</td>
<td class="left">take part in</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">play</td>
<td class="left">hang out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">see</td>
<td class="left">spot</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">seem</td>
<td class="left">sound</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">support</td>
<td class="left">be all for</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">surprise</td>
<td class="left">freak out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">understand</td>
<td class="left">figure out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">want</td>
<td class="left">expect</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">比……重要</th>
<th scope="col" class="left">outweigh</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">使转向</td>
<td class="left">redirect</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 动词短语</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">be good for</th>
<th scope="col" class="left">be beneficial to</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">become better</td>
<td class="left">improve</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">become worse</td>
<td class="left">deteriorate</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">deal with</td>
<td class="left">cope with</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">try hard to</td>
<td class="left">strive to</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">want to</td>
<td class="left">dream to</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">intend to</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">建立</th>
<th scope="col" class="left">build up</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">在外面吃</td>
<td class="left">eat out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">放松</td>
<td class="left">get relaxed</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">位于</td>
<td class="left">situated in</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">求助于</td>
<td class="left">turn to</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 动宾短语</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">十分受欢迎</th>
<th scope="col" class="left">enjoys great popularity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">带来很多欢乐</td>
<td class="left">brings a lot of fun to</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">使……远离……</td>
<td class="left">keep &#x2026; far from &#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">转移注意力</td>
<td class="left">take one's mind off &#x2026;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 形容词</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">attractive</th>
<th scope="col" class="left">appealing</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">bad</td>
<td class="left">severe</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">beautiful</td>
<td class="left">stunning</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">gorgeous</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">aesthetically pleasing to our eyes</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">big</td>
<td class="left">gigantic</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">enormous</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">changing</td>
<td class="left">varying</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">cheap</td>
<td class="left">economical</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">common</td>
<td class="left">commonplace</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">cute</td>
<td class="left">adorable</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">different</td>
<td class="left">distinct</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">difficult</td>
<td class="left">tough</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">disgusting</td>
<td class="left">gross</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">essential</td>
<td class="left">indispensable</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">expensive</td>
<td class="left">pricey</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">famous</td>
<td class="left">celebrated</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">few</td>
<td class="left">scarce</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">limited number of</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">good</td>
<td class="left">decent</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">desirable</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">happy</td>
<td class="left">delighted</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">hard</td>
<td class="left">tough</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">important</td>
<td class="left">vital</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">essential</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">many</td>
<td class="left">numerous</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">a multitude of</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">vast amounts of</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">tons, piles, loads of</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">more</td>
<td class="left">a wider range of</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">new</td>
<td class="left">fresh</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">old</td>
<td class="left">conventional</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">perfect</td>
<td class="left">flawless</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">spotless</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">poor</td>
<td class="left">impoverished</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">proper</td>
<td class="left">ideal</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">real</td>
<td class="left">genuine</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">authentic</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">reasonable</td>
<td class="left">make sense</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">same</td>
<td class="left">equally</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">small</td>
<td class="left">limited</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">strange</td>
<td class="left">odd</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">weird</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">whole</td>
<td class="left">entire</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">有限的</th>
<th scope="col" class="left">limited</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">合格的，有资格的</td>
<td class="left">qualified</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">合理的，正确的</td>
<td class="left">reasonable</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">sensible</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">典型的，代表性的</td>
<td class="left">typical</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">不寻常的</td>
<td class="left">uncommon</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">unusual</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 形容词短语</h2>
<div class="outline-text-2" id="text-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">kinds of</td>
<td class="left">a range of</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 副词</h2>
<div class="outline-text-2" id="text-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">almost</th>
<th scope="col" class="left">practically</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">always</td>
<td class="left">constantly</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">around the clock</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">before</td>
<td class="left">ahead</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">certainly</td>
<td class="left">surely</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">completely</td>
<td class="left">entirely</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">fast</td>
<td class="left">rapidly</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">like</td>
<td class="left">similar to</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">soon</td>
<td class="left">shortly</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">very</td>
<td class="left">pretty</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">terribly</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">extremely</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">when</td>
<td class="left">as soon as</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">几乎，差不多</th>
<th scope="col" class="left">nearly</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">明显地，显然地</td>
<td class="left">obviously</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">相对地，比较地</td>
<td class="left">fairly</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> 副词短语</h2>
<div class="outline-text-2" id="text-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">a lot</th>
<th scope="col" class="left">massively</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">during the day</td>
<td class="left">at day time</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">in the same way</td>
<td class="left">alike</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">not often</td>
<td class="left">rarely</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">次数最多</th>
<th scope="col" class="left">for the most times</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">从心底</td>
<td class="left">in the bottom of my heart</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">在很多场合</td>
<td class="left">in various occasions</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">不逊色于</td>
<td class="left">no less than</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">工作以外</td>
<td class="left">off the work</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">某种程度上</td>
<td class="left">to some extent</td>
</tr>
</tbody>
</table>

<p>
时间
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">直到现在</th>
<th scope="col" class="left">up until now</th>
</tr>

<tr>
<th scope="col" class="left">直到那时</th>
<th scope="col" class="left">up until then</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">每周</td>
<td class="left">on a weekly basis</td>
</tr>

<tr>
<td class="left">定期，经常</td>
<td class="left">on a regular basis</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">时不时，偶尔</td>
<td class="left">every now and then</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">once in a while</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 其他短语</h2>
<div class="outline-text-2" id="text-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">is different for &#x2026; and &#x2026;</th>
<th scope="col" class="left">vary between &#x2026; and &#x2026;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">is different with &#x2026;</td>
<td class="left">differ from &#x2026;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">没什么坏处</th>
<th scope="col" class="left">won't hurt</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">can never hurt</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">没什么意义</td>
<td class="left">It's pointless to &#x2026;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">There is no sense in &#x2026;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">来自……的压力</td>
<td class="left">pressure coming from &#x2026;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-05-27 周五 19:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
